app/controllers/manage/articles_controller.rb

SELECT * FROM `articles`
---
  def index
    @articles = Article.all

SELECT * FROM `articles` WHERE (`articles`.`id` = 11)
---
  def edit
    @article = Article.find(params[:id])

SELECT * FROM `articles` WHERE (`articles`.`id` = 11)
SELECT * FROM `comments` WHERE (`comments`.article_id = 11)
---
  def show
    @article = Article.find(params[:id])
    @comments = Comment.all

INSERT INTO `articles` (`created_at`, `title`, `body`, `priority`, `image`) VALUES('2011-04-24 17:42:56', 'Ghbdtn', 'Ghbdtn', 3, '')
---
  def create
    @article = Article.new(params[:article])
    respond_to do |format|
      if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 11)
UPDATE `articles` SET `image` = 'ghbdtn' WHERE `id` = 11
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])

SELECT * FROM `articles` WHERE (`articles`.`id` = 11)
DELETE FROM `articles` WHERE `id` = 11
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy

INSERT INTO `comments` (`created_at`, `body`, `author_name`, `article_id`, `author_email`) VALUES('2011-05-01 09:33:55', '1111', '1111', 12, '1111')
SELECT * FROM `articles` WHERE (`articles`.`id` = 0)
---
  def comment
    Article.find(params[:id]).comments.create(params[:comment])