app/controllers/manage/comments_controller.rb

  def destroy
    @comment = Comment.find(params[:id])
    @hh = @comment.article
    @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 16)
DELETE FROM `comments` WHERE `id` = 16