app/controllers/manage/contacts_controller.rb

SELECT `contacts`.id FROM `contacts` LIMIT 1
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)
---
  def index
    if Contact.exists?
      @contact = Contact.find(1)

SELECT `contacts`.id FROM `contacts` LIMIT 1
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)
---
  def edit
    if Contact.exists?
      @contact = Contact.find(1)

SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)
UPDATE `contacts` SET `url` = 'he' WHERE `id` = 1
---
  def update
    @contact = Contact.find(1)

    respond_to do |format|
      if @contact.update_attributes(params[:contact])