app/controllers/manage/degrees_controller.rb

  def index
    @degrees = Degree.search(params[:search],params[:page])
---
SELECT * FROM `degrees`

  def edit
    @degrees = Degree.search(params[:search],params[:page])
    @degree = Degree.find(params[:id])
---
SELECT * FROM `degrees`
SELECT * FROM `degrees` WHERE (`degrees`.`id` = 1)

  def create
    @degree = Degree.new(params[:degree])
    @degrees = Degree.search(params[:search],params[:page])

    respond_to do |format|
      if @degree.save
---
INSERT INTO `degrees` (`name`, `short_name`) VALUES('Пирлло', 'ловдало')

  def update
    @degree = Degree.find(params[:id])
    @degrees = Degree.search(params[:search],params[:page])

    respond_to do |format|
      if @degree.update_attributes(params[:degree])
---
SELECT * FROM `degrees` WHERE (`degrees`.`id` = 1)
UPDATE `degrees` SET `short_name` = 'к.т.' WHERE `id` = 1

  def destroy
    @degree = Degree.find(params[:id])
    @degree.destroy
---
SELECT * FROM `degrees` WHERE (`degrees`.`id` = 3)
DELETE FROM `degrees` WHERE `id` = 3