app/controllers/manage/diplomas_controller.rb

  def index
    @diplomas = Diploma.all(:include => :student, :include => :teacher)
---
SELECT * FROM `diplomas`

  def edit
    @diploma = Diploma.find(params[:id])
    @students = Student.all(:include => :person)
    @teachers = Teacher.all(:include => :person)
---
SELECT * FROM `diplomas` WHERE (`diplomas`.`id` = 5)
SELECT * FROM `students`
SELECT * FROM `teachers`

  def new
    @diploma = Diploma.new
    @students = Student.all(:include => :person)
    @teachers = Teacher.all(:include => :person)
---
SELECT * FROM `students`
SELECT * FROM `teachers`

  def show
    @diploma = Diploma.find(params[:id],:include => :teacher, :include => :student)
---
SELECT * FROM `diplomas` WHERE (`diplomas`.`id` = 5)

    def create
    @diploma = Diploma.new(params[:diploma])
    respond_to do |format|
      if @diploma.save
---
INSERT INTO `diplomas` (`name`, `student_id`, `protection_year`, `teacher_id`, `summary`) VALUES('Как завоевать мир', 9, 2006, 1, 'Нету')

  def update
    @diploma = Diploma.find(params[:id])
#    respond_to do |format|
#      if diploma.update_attributes(params[:diploma])
#        format.html { redirect_to(manage_diploma_path(@diploma), :notice => 'Сведения о дипломе были успешно изменены') }
#        format.xml  { render :xml => @diploma, :status => :created, :location => @diploma }
#      else
#        format.html { render :action => "edit" }
#        format.xml  { render :xml => @diploma.errors, :status => :unprocessable_entity }
#      end
#    end

    @diploma.update_attributes(params[:diploma]) ? redirect_to(manage_diploma_path(@diploma)) : render(:action => :edit)
---
SELECT * FROM `diplomas` WHERE (`diplomas`.`id` = 5)
UPDATE `diplomas` SET `student_id` = 13 WHERE `id` = 6

  def destroy
    @diploma = Diploma.find(params[:id])
    @diploma.destroy
---
SELECT * FROM `diplomas` WHERE (`diplomas`.`id` = 5)
DELETE FROM `diplomas` WHERE `id` = 5