app/controllers/manage/disciplines_controller.rb

SELECT * FROM `disciplines`
---
  def index
    @disciplines = Discipline.all

SELECT * FROM `disciplines`
SELECT * FROM `disciplines` WHERE (`disciplines`.`id` = 4)
---
  def edit
    @disciplines = Discipline.all
    @newdiscipline = Discipline.find(params[:id])

INSERT INTO `disciplines` (`name`) VALUES('Системное ПО')
---
  def create
    @discipline = Discipline.new(params[:discipline])

    respond_to do |format|
      if @discipline.save

SELECT * FROM `disciplines` WHERE (`disciplines`.`id` = 4)
UPDATE `disciplines` SET `name` = 'Системное ПОнет' WHERE `id` = 4
---
  def update
    @discipline = Discipline.find(params[:id])

    respond_to do |format|
      if @discipline.update_attributes(params[:discipline])

SELECT * FROM `disciplines` WHERE (`disciplines`.`id` = 4)
DELETE FROM `disciplines` WHERE `id` = 4
---
  def destroy
    @discipline = Discipline.find(params[:id])
    @discipline.destroy