app/controllers/manage/disciplines_teachers_controller.rb

  def index
    @dts= DisciplinesTeacher.search(params[:search],params[:page])
    @newdt = DisciplinesTeacher.new
    @disciplines = Discipline.all(:order => 'name')
    @teachers = Teacher.all( :include => :person )
---
SELECT * FROM `disciplines_teachers`
SELECT * FROM `teachers`
SELECT * FROM `disciplines`
SELECT * FROM `teachers` WHERE (`teachers`.`person_id` = 1)

  def edit
    @dts= DisciplinesTeacher.all
    @newdt = DisciplinesTeacher.find(params[:id])
    @disciplines = Discipline.all
    @teachers = Teacher.all( :include => :person )
---
SELECT * FROM `disciplines_teachers`
SELECT * FROM `teachers`
SELECT * FROM `disciplines_teachers` WHERE (`disciplines_teachers`.`id` = 13)
SELECT * FROM `disciplines`
SELECT * FROM `teachers` WHERE (`teachers`.`person_id` = 7)

  def create
    @disciplines_teacher = DisciplinesTeacher.new(params[:disciplines_teacher])
    @dts= DisciplinesTeacher.search(params[:search],params[:page])

    respond_to do |format|
      if @disciplines_teacher.save
---
SELECT `disciplines_teachers`.id FROM `disciplines_teachers` WHERE (`disciplines_teachers`.`teacher_id` = 1 AND `disciplines_teachers`.discipline_id = 1) LIMIT 1
INSERT INTO `disciplines_teachers` (`teacher_id`, `discipline_id`) VALUES(7, 1)

  def update
    @disciplines_teacher = DisciplinesTeacher.find(params[:id])
    @dts= DisciplinesTeacher.search(params[:search],params[:page])

    respond_to do |format|
      if @disciplines_teacher.update_attributes(params[:disciplines_teacher])
---
SELECT * FROM `disciplines_teachers` WHERE (`disciplines_teachers`.`id` = 13)
UPDATE `disciplines_teachers` SET `teacher_id` = 1 WHERE `id` = 13

  def destroy
    @dt = DisciplinesTeacher.find(params[:id])
    @dt.destroy
---
SELECT * FROM `disciplines_teachers` WHERE (`disciplines_teachers`.`id` = 13)
DELETE FROM `disciplines_teachers` WHERE `id` = 13