app/controllers/manage/histories_controller.rb

SELECT `histories`.id FROM `histories` LIMIT 1
SELECT * FROM `histories` WHERE (`histories`.`id` = 1)
---
  def index
    if Historie.exists?
      @historie = Historie.find(1)

SELECT `histories`.id FROM `histories` LIMIT 1
SELECT * FROM `histories` WHERE (`histories`.`id` = 1)
---
  def edit
    if Historie.exists?
      @historie = Historie.find(1)

SELECT * FROM `histories` WHERE (`histories`.`id` = 1)
UPDATE `histories` SET `image` = 'hello.jpg', `body` = '1212121' WHERE `id` = 1
---
  def update
    @historie = Historie.find(1)

    respond_to do |format|
      if @historie.update_attributes(params[:historie])