app/controllers/manage/links_controller.rb

SELECT * FROM `links`
---
  def index
    @links = Link.all

SELECT * FROM `links`
SELECT * FROM `links` WHERE (`links`.`id` = 7)
---
  def edit
    @links = Link.all
    @newlink = Link.find(params[:id])

INSERT INTO `links` (`url`, `description`) VALUES('www.fryazino.net', '')
---
  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save

SELECT * FROM `links` WHERE (`links`.`id` = 7)
UPDATE `links` SET `url` = 'https://github.com/' WHERE `id` = 5
---
  def update
    @link = Link.find(params[:id])

    respond_to do |format|
      if @link.update_attributes(params[:link])

SELECT * FROM `links` WHERE (`links`.`id` = 7)
DELETE FROM `links` WHERE `id` = 7
---
  def destroy
    @link = Link.find(params[:id])
    @link.destroy