app/controllers/manage/positions_controller.rb

SELECT * FROM `positions`
---
  def index
    @positions = Position.all

SELECT * FROM `positions`
SELECT * FROM `positions` WHERE (`positions`.`id` = 3)
---
  def edit
    @positions = Position.all
    @newposition = Position.find(params[:id])

INSERT INTO `positions` (`name`, `short_name`) VALUES('крутой', 'крутой')
---
  def create
    @position = Position.new(params[:position])
    respond_to do |format|
      if @position.save

SELECT * FROM `positions` WHERE (`positions`.`id` = 3)
UPDATE `positions` SET `short_name` = 'преп.' WHERE `id` = 3
---
  def update
    @position = Position.find(params[:id])

    respond_to do |format|
      if @position.update_attributes(params[:position])

SELECT * FROM `positions` WHERE (`positions`.`id` = 3)
DELETE FROM `positions` WHERE `id` = 3
---
  def destroy
    @position = Position.find(params[:id])
    @position.destroy