app/controllers/manage/specialities_controller.rb

SELECT * FROM `specialities`
---
  def index
    @specialities = Speciality.all

SELECT * FROM `specialities` WHERE (`specialities`.`id` = 2)
---
  def edit
    @speciality = Speciality.find(params[:id])

INSERT INTO `specialities` (`name`, `code`, `count_years`, `short_name`, `in_diploma`) VALUES('НДН', '212121', 6, 'НДН', 'some')
---
  def create
    @speciality = Speciality.new(params[:speciality])

    respond_to do |format|
      if @speciality.save

SELECT * FROM `specialities` WHERE (`specialities`.`id` = 4)
UPDATE `specialities` SET `short_name` = 'НДb' WHERE `id` = 4
---
  def update
    @speciality = Speciality.find(params[:id])

    respond_to do |format|
      if @speciality.update_attributes(params[:speciality])

SELECT * FROM `specialities` WHERE (`specialities`.`id` = 2)
DELETE FROM `specialities` WHERE `id` = 5
---
  def destroy
    @speciality = Speciality.find(params[:id])
    @speciality.destroy