app/controllers/manage/students_controller.rb

SELECT * FROM `students`
---
  def index
    @students = Student.all(:include => :person, :include => :speciality)

SELECT * FROM `specialities`
---
  def new
    @student = Student.new
    @student.build_person
    @specialities = Speciality.all

SELECT * FROM `specialities`
---
  def edit
    @student = Student.find(params[:id])
    @student.person.update_attributes(params[:student])
    @specialities = Speciality.all

SELECT * FROM `specialities` WHERE (`specialities`.`id` = 1)
SELECT * FROM `students` WHERE (`students`.`person_id` = 9)
---
  def show
    @student = Student.find(params[:id],:include => :person, :include => :speciality)

INSERT INTO `students` (`year_income`, `speciality_id`, `person_id`) VALUES(2008, 2, 10)
---
  def create
    @student = Student.new(params[:student])
    @student.person.nature = 's'
    respond_to do |format|
      if @student.save

SELECT * FROM `students` WHERE (`students`.person_id = 10) LIMIT 1
---
  def destroy
    @student = Student.find(params[:id])