app/controllers/manage/teachers_controller.rb

SELECT * FROM `teachers`
---
  def index
    @teachers = Teacher.all(:include => :person, :include => :speciality, :include => :position, :include => :degree)

SELECT * FROM `degrees`
SELECT * FROM `positions`
---
  def new
    @teacher = Teacher.new
    @teacher.build_person
    @degrees = Degree.all
    @positions = Position.all

SELECT * FROM `degrees`
SELECT * FROM `positions`
---
  def edit
    @teacher = Teacher.find(params[:id])
    @teacher.person.update_attributes(params[:teacher])
    @degrees = Degree.all
    @positions = Position.all

SELECT * FROM `degrees` WHERE (`degrees`.`id` = 2)
SELECT * FROM `positions` WHERE (`positions`.`id` = 2)
SELECT * FROM `teachers` WHERE (`teachers`.`person_id` = 7)
---
  def show
    @teacher = Teacher.find(params[:id], :include => :person, :include => :speciality, :include => :position, :include => :degree)

INSERT INTO `teachers` (`degree_id`, `person_id`, `position_id`) VALUES(2, 12, 2)
---
  def create
    @teacher = Teacher.new(params[:teacher])
    @teacher.person.nature = 't'

    respond_to do |format|
      if @teacher.save