app/controllers/articles_controller.rb

SELECT * FROM `articles`
---
  def index
    @articles = Article.all

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.article_id = 1)
---
  def show
    @article = Article.find(params[:id])
    @comments = Comment.all

INSERT INTO `articles` (`title`, `body`, `priority`, `published_at`, `image`) VALUES('Сессия', 'Вот и настала Сессия №Last для ИВТ-Д-4', 2, '1990-01-12 12:22:22', '')
---
  def create
    @article = Article.new(params[:article])
    respond_to do |format|
      if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
UPDATE `articles` SET `publicated_date` = '1999-05-12 12:23:01' WHERE `id` = 1
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])

INSERT INTO `comments` (`created_at`, `body`, `author_name`, `article_id`, `author_email`) VALUES('2011-04-22 22:18:57', 'Я против такого позора', 'Helen', 3, 'helen@bk.net')
SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
---
  def comment
    Article.find(params[:id]).comments.create(params[:comment])