app/controllers/comments_controller.rb

  def edit
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

  def show
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`name_author`, `body`, `email_author`) VALUES('admin', 'Неплохо посидели!', 'psjob@bk.ru')

  def update
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 2)
DELETE FROM `comments` WHERE `id` = 2