app/controllers/contacts_controller.rb

  def index
    if Contact.exists?
      @contact = Contact.find(1)
---
SELECT `contacts`.id FROM `contacts` LIMIT 1
SELECT `contacts`.id FROM `contacts` WHERE (`contacts`.`id` = 1) LIMIT 1

  def edit
    if Contact.exists?
      @contact = Contact.find(1)
---
SELECT `contacts`.id FROM `contacts` LIMIT 1
SELECT `contacts`.id FROM `contacts` WHERE (`contacts`.`id` = 1) LIMIT 1

  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save
---
INSERT INTO `contacts` (`address`, `url`, `phones`, `image`, `email`) VALUES('Москва, ул. Вильгельма Пика, д.4, корпус 5, 410 ауд', 'www.rgsu.ru', '3993988298', '', 'hello@mail.net')

  def update
    @contact = Contact.find(1)

    respond_to do |format|
      if @contact.update_attributes(params[:contact])
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)
UPDATE `contacts` SET `adres` = 'Москва, ул. Вильгельма Пика, д.4. корп. 5, каб.40633' WHERE `id` = 1