app/controllers/degrees_controller.rb

SELECT * FROM `degrees`
---
  def index
    @degrees = Degree.all

SELECT * FROM `degrees`
SELECT * FROM `degrees` WHERE (`degrees`.`id` = 1)
---
  def edit
    @degrees = Degree.all
    @newdegree = Degree.find(params[:id])

INSERT INTO `degrees` (`name`, `short_name`) VALUES('кандидат технических наук', 'к.т.н.')
---
  def create
    @degree = Degree.new(params[:degree])

    respond_to do |format|
      if @degree.save

SELECT * FROM `degrees` WHERE (`degrees`.`id` = 1)
UPDATE `degrees` SET `short_name` = 'к. т. н.' WHERE `id` = 1
---
  def update
    @degree = Degree.find(params[:id])

    respond_to do |format|
      if @degree.update_attributes(params[:degree])