app/controllers/diplomas_controller.rb

  def index
    @diplomas = Diploma.all(:include => :student, :include => :teacher, :include => :person)
---
SELECT * FROM `students` WHERE (`students`.`person_id` = 3)
SELECT * FROM `teachers` WHERE (`teachers`.`person_id` IN (1,5))