app/controllers/diplomas_controller.rb

  def index
    @diplomas = Diploma.all(:include => :student, :include => :teacher)
---
SELECT * FROM `diplomas`

  def edit
    @diploma = Diploma.find(params[:id])
    @students = Student.all(:include => :person)
    @teachers = Teacher.all(:include => :person)
---
SELECT * FROM `diplomas` WHERE (`diplomas`.`id` = 1)
SELECT * FROM `students`
SELECT * FROM `teachers`

  def new
    @diploma = Diploma.new
    @students = Student.all(:include => :person)
    @teachers = Teacher.all(:include => :person)
---
SELECT * FROM `students`
SELECT * FROM `teachers`

  def show
    @diploma = Diploma.find(params[:id],:include => :teacher, :include => :student)
---
SELECT * FROM `diplomas` WHERE (`diplomas`.`id` = 1)

    def create
    @diploma = Diploma.new(params[:diploma])
    respond_to do |format|
      if @diploma.save
---
INSERT INTO `diplomas` (`name`, `student_id`, `protection_year`, `teacher_id`, `summary`) VALUES('Hello World', 3, 2005, 1, 'This is the best programm')

  def update
    @diploma = Diploma.find(params[:id])
    @diploma.update_attributes(params[:diploma]) ? redirect_to(diploma_path(@diploma)) : render(:action => :edit)
---
SELECT * FROM `diplomas` WHERE (`diplomas`.`id` = 2)
UPDATE `diplomas` SET `teacher_id` = 5, `student_id` = 3 WHERE `id` = 1

  def destroy
    @diploma = Diploma.find(params[:id])
    @diploma.destroy
---
SELECT * FROM `diplomas` WHERE (`diplomas`.`id` = 2)
DELETE FROM `diplomas` WHERE `id` = 2