app/controllers/disciplines_teachers_controller.rb

  def index
    @dts= DisciplinesTeacher.all
    @newdt = DisciplinesTeacher.new
    @disciplines = Discipline.all
    @teachers = Teacher.all( :include => :person )
---
SELECT * FROM `disciplines_teachers`
SELECT * FROM `teachers`
SELECT * FROM `disciplines`
SELECT * FROM `teachers` WHERE (`teachers`.`person_id` = 1)

  def edit
    @dts= DisciplinesTeacher.all
    @newdt = DisciplinesTeacher.find(params[:id])
    @disciplines = Discipline.all
    @teachers = Teacher.all( :include => :person )
---
SELECT * FROM `disciplines_teachers`
SELECT * FROM `teachers`
SELECT * FROM `disciplines_teachers` WHERE (`disciplines_teachers`.`id` = 4)
SELECT * FROM `disciplines`
SELECT * FROM `teachers` WHERE (`teachers`.`person_id` = 1)

  def create
    @disciplines_teacher = DisciplinesTeacher.new(params[:disciplines_teacher])

    respond_to do |format|
      if @disciplines_teacher.save
---
INSERT INTO `disciplines_teachers` (`teacher_id`, `discipline_id`) VALUES(1, 1)

  def update
    @disciplines_teacher = DisciplinesTeacher.find(params[:id])

    respond_to do |format|
      if @disciplines_teacher.update_attributes(params[:disciplines_teacher])
---
SELECT * FROM `disciplines_teachers` WHERE (`disciplines_teachers`.`id` = 8)
UPDATE `disciplines_teachers` SET `discipline_id` = 2 WHERE `id` = 13

  def destroy
    @dt = DisciplinesTeacher.find(params[:id])
    @dt.destroy
---
SELECT * FROM `disciplines_teachers` WHERE (`disciplines_teachers`.`id` = 5)
DELETE FROM `disciplines_teachers` WHERE `id` = 5