app/controllers/disciplines_controller.rb

SELECT * FROM `disciplines`
---
  def index
    @disciplines = Discipline.all

SELECT * FROM `disciplines`
SELECT * FROM `disciplines` WHERE (`disciplines`.`id` = 7)
---
  def edit
    @disciplines = Discipline.all
    @newdiscipline = Discipline.find(params[:id])

INSERT INTO `disciplines` (`name`) VALUES('Теория разработки программного обеспечения')
---
  def create
    @discipline = Discipline.new(params[:discipline])

    respond_to do |format|
      if @discipline.save

SELECT * FROM `disciplines` WHERE (`disciplines`.`id` = 7)
UPDATE `disciplines` SET `name_disc` = 'Теория языков раммирования' WHERE `id` = 7
---
  def update
    @discipline = Discipline.find(params[:id])

    respond_to do |format|
      if @discipline.update_attributes(params[:discipline])