app/controllers/links_controller.rb

SELECT * FROM `links`
---
  def index
    @links = Link.all

SELECT * FROM `links`
SELECT * FROM `links` WHERE (`links`.`id` = 1)
---
  def edit
    @links = Link.all
    @newlink = Link.find(params[:id])

INSERT INTO `links` (`url`, `description`) VALUES('www.vkontakte.ru', 'Российская социальная сеть!')
---
  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save

SELECT * FROM `links` WHERE (`links`.`id` = 1)
UPDATE `links` SET `description` = 'Российская социалка' WHERE `id` = 1
---
  def update
    @link = Link.find(params[:id])

    respond_to do |format|
      if @link.update_attributes(params[:link])

SELECT * FROM `links` WHERE (`links`.`id` = 1)
DELETE FROM `links` WHERE `id` = 1
---
  def destroy
    @link = Link.find(params[:id])
    @link.destroy