app/controllers/positions_controller.rb

SELECT * FROM `positions`
---
  def index
    @positions = Position.all

SELECT * FROM `positions`
SELECT * FROM `positions` WHERE (`positions`.`id` = 1)
---
  def edit
    @positions = Position.all
    @newposition = Position.find(params[:id])

INSERT INTO `positions` (`name`, `short_name`) VALUES('доцент', 'доц.')
---
  def create
    @position = Position.new(params[:position])

    respond_to do |format|
      if @position.save

SELECT * FROM `positions` WHERE (`positions`.`id` = 1)
UPDATE `positions` SET `short_name` = 'доц,' WHERE `id` = 1
---
  def update
    @position = Position.find(params[:id])

    respond_to do |format|
      if @position.update_attributes(params[:position])