app/controllers/specialities_controller.rb

SELECT * FROM `specialities`
---
  def index
    @specialities = Speciality.all

SELECT * FROM `specialities` WHERE (`specialities`.`id` = 1)
---
  def edit
    @speciality = Speciality.find(params[:id])

INSERT INTO `specialities` (`name`, `code`, `count_years`, `short_name`, `in_diploma`) VALUES('Информатика и вычислительная техника', '230100', 4, 'ИВТ', 'Бакалавр техники и технологии')
---
  def create
    @speciality = Speciality.new(params[:speciality])

    respond_to do |format|
      if @speciality.save

SELECT * FROM `specialities` WHERE (`specialities`.`id` = 1)
---
  def update
    @speciality = Speciality.find(params[:id])

SELECT * FROM `specialities` WHERE (`specialities`.`id` = 3)
DELETE FROM `specialities` WHERE `id` = 3
---
  def destroy
    @speciality = Speciality.find(params[:id])
    @speciality.destroy