app/controllers/students_controller.rb

  def index
    @students = Student.all(:include => [:person, :speciality], :conditions => ['speciality_id = ? AND year_income = ?',params[:speciality_id], params[:year_income]],:order => 'people.last_name')
    @speciality = Speciality.find(params[:speciality_id])
---
SELECT * FROM `specialities` WHERE (`specialities`.`id` IN (1,2))