app/controllers/students_controller.rb

SELECT * FROM `students`
---
  def index
    @students = Student.all(:include => :person, :include => :speciality)

SELECT * FROM `specialities`
---
  def new
    @student = Student.new
    @student.build_person
    @specialities = Speciality.all

SELECT * FROM `specialities`
---
  def edit
    @student = Student.find(params[:id])
    @student.person.update_attributes(params[:student])
    @specialities = Speciality.all

SELECT * FROM `specialities` WHERE (`specialities`.`id` = 1)
SELECT * FROM `students` WHERE (`students`.`person_id` = 2)
---
  def show
    @student = Student.find(params[:id],:include => :person, :include => :speciality)

INSERT INTO `students` (`year_income`, `speciality_id`, `person_id`) VALUES(2007, 1, 2)
---
  def create
    @student = Student.new(params[:student])
    @student.person.nature = 's'
    @student.save ? redirect_to(student_path(@student)) : render(:action => "new")

UPDATE `students` SET `year_income` = 2006 WHERE `person_id` = 4
---
  def update
    @student = Student.find(params[:id])
    @student.person.nature = 's'
    @student.update_attributes(params[:student]) ? redirect_to(student_path(@student)) : render(:action => :edit)

SELECT * FROM `students` WHERE (`students`.person_id = 3) LIMIT 1
---
  def destroy
    @student = Student.find(params[:id])