app/controllers/teachers_controller.rb

  def index
    @teachers = Teacher.all(:include => :person, :include => :speciality, :include => :position, :include => :degree)
---
SELECT * FROM `teachers`

  def new
    @teacher = Teacher.new
    @teacher.build_person
    @degrees = Degree.all
    @positions = Position.all
---
SELECT * FROM `degrees`
SELECT * FROM `positions`

  def edit
    @teacher = Teacher.find(params[:id])
    @teacher.person.update_attributes(params[:teacher])
    @degrees = Degree.all
    @positions = Position.all
---
SELECT * FROM `degrees`
SELECT * FROM `positions`

  def show
    @teacher = Teacher.find(params[:id], :include => :person, :include => :speciality, :include => :position, :include => :degree)
---
SELECT * FROM `degrees` WHERE (`degrees`.`id` = 1)
SELECT * FROM `positions` WHERE (`positions`.`id` = 2)
SELECT * FROM `teachers` WHERE (`teachers`.`person_id` = 1)

  def create
    @teacher = Teacher.new(params[:teacher])
    @teacher.person.nature = 't'
    @teacher.save ? redirect_to(teacher_path(@teacher)) : render(:action => "new")
---
INSERT INTO `teachers` (`degree_id`, `person_id`, `position_id`) VALUES(1, 4, 1)

  def update
    @teacher = Teacher.find(params[:id])
    @teacher.person.nature = 't'
    @teacher.update_attributes(params[:teacher]) ? redirect_to(teacher_path(@teacher)) : render(:action => :edit)
---
UPDATE `teachers` SET `position_id` = 2, `degree_id` = 2 WHERE `person_id` = 4

  def destroy
    @teacher = Teacher.find(params[:id])
---
SELECT * FROM `teachers` WHERE (`teachers`.person_id = 4) LIMIT 1